let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]; // กำหนดอาร์เรย์
 
var  A1 = arr.filter(num => num % 2 === 0) // คัดเลือกเฉพาะตัวเลขที่หาร 2 ลงตัว โดยใช้ filter() ฟังก์ชัน
var  A2 = A1.map(num => num * 1000) // นำตัวเลขที่ได้มาคูณด้วย 1000 โดยใช้ map() ฟังก์ชัน
var  A3 = A2.reduce((acc, curr) => acc + curr, 0); // หาผลรวม

console.log("ตัวเลขในอาร์เรย์คือ: " + arr); // แสดงตัวเลขในอาร์เรย์
console.log("ตัวเลขที่หาร 2 ลงตัวคือ: " + A1); // ผลลัพธ์จากการกรองตัวเลขในอาร์เรย์ arr และเลือกเฉพาะตัวเลขที่หารด้วย 2 ลงตัวโดยใช้ filter() ฟังก์ชัน
console.log("เมื่อนำตัวเลขที่หาร 2 ลงตัวมาคูณ 1000 จะได้: " + A2); // ผลลัพธ์จากการนำตัวเลขที่ได้จาก A1 มาคูณด้วย 1,000 โดยใช้ map() ฟังก์ชัน
console.log("เมื่อนำมารวมกันจะได้: " + A3); // ผลลัพธ์ของผลรวม

